export default function getBaanName(params: { num: number }) {
  const BannName: string[] = [
    "ติดตลกแต่ไม่ตลอด แอบชอบเธอตลอดอันนี้ไม่ตลก",
    "ติดเตียงเพราะขาหัก หรือจมปลักเพราะรักเธอ",
    "ติดบั๊กยังแก้ไม่ยาก แต่รักเธอมากๆอันนี้แก้ไม่ได้",
    "ติดลิฟต์ต้องโทรเบอร์ช่าง แต่ถ้าอยากจีบเธอติดบ้าง ต้องโทรเบอร์อะไร",
    "ติดจุฬายังต้องเตรียมสอบ ติดเธอตลอดไม่ต้องเตรียมใจ",
    "ติดแกลม ติดเก๊ก แล้วเมื่อไหร่จะถูกสเปคเธอ",
    "ติดใจแล้วเลิกยาก ติดเธอมากเลิกไม่ได้",
    "ติดฝนตอนไม่มีใคร ดีกว่าติดใจตอนไม่มีเธอ",
  ];
  return BannName[params.num - 1];
}
