export function getItemName(params: { num: number }) {
  const ItemName: string[] = [
    "พิมพ์เขียวทะลุมิติ",
    "มิเตอร์สารพัดประโยชน์",
    "เครื่องวิเคราะห์ขนาดพกพา",
    "แผ่นพับสอดส่องเครื่องจักร",
    "ล็อกเก็ตสแกนองค์ประกอบ",
    "MagicBot",
    "อินเทอร์เน็ตไร้ขอบเขต",
    "เครื่องพิมพ์โลหะ 3D",
    "คีย์บอร์ดกระแสจิต",
    "ครัวซองวิเศษ",
    "กล่องวิเคราะห์แร่",
  ];
  return ItemName[params.num];
}

export function getDressName(params: { num: number }) {
  const DressName: string[] = [
    "พิมพ์เขียวทะลุมิติ",
    "มิเตอร์สารพัดประโยชน์",
    "เครื่องวิเคราะห์ขนาดพกพา",
    "แผ่นพับสอดส่องเครื่องจักร",
    "ล็อกเก็ตสแกนองค์ประกอบ",
    "MagicBot",
    "อินเทอร์เน็ตไร้ขอบเขต",
    "เครื่องพิมพ์โลหะ 3D",
    "คีย์บอร์ดกระแสจิต",
    "ครัวซองวิเศษ",
    "กล่องวิเคราะห์แร่",
  ];
  return DressName[params.num];
}